In [99]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
import sklearn
import math as m
from sklearn import *
%matplotlib inline

### Load the dataset from kaggle <br/><br/> Link: https://www.kaggle.com/c/titanic/data

In [100]:
df_test=pd.read_csv(r"..\Data\Titanic_test.csv")

In [101]:
df_train=pd.read_csv(r"..\Data\Titanic_train.csv")

In [102]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [103]:
df_test.shape,df_train.shape

((418, 11), (891, 12))

In [104]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [105]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [106]:
df_train.Age.mean()

29.69911764705882

In [107]:
#output class
target="Survived"
y=df_train[target]
del [df_train[target],df_train['Ticket'],df_train['Name'], df_train['Cabin']]
df_train.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1       3    male  22.0      1      0   7.2500        S
1            2       1  female  38.0      1      0  71.2833        C
2            3       3  female  26.0      0      0   7.9250        S
3            4       1  female  35.0      1      0  53.1000        S
4            5       3    male  35.0      0      0   8.0500        S

In [108]:
del [df_test['Ticket'],df_test['Name'],df_test['Cabin']]

In [109]:
df_train.shape,y.shape, df_test.shape

((891, 8), (891,), (418, 8))

In [110]:
t1=df_train.isnull().sum()
t1

PassengerId      0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [111]:
i=df_train.Age.isnull()
df_train['Age'][i]=round(df_train.Age.mean(),1)

c:\users\gaurav\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [112]:
t1=df_train.isnull().sum()
t1

PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       2
dtype: int64

In [113]:
t2=df_test.isnull().sum()
t2

PassengerId     0
Pclass          0
Sex             0
Age            86
SibSp           0
Parch           0
Fare            1
Embarked        0
dtype: int64

In [114]:
# handling null values in Age and Fare for test
i1=df_test.Age.isnull()
df_test['Age'][i1]=round(df_test.Age.mean(),1)
i2=df_test.Fare.isnull()
df_test['Fare'][i2]=df_test.Fare.mean()

c:\users\gaurav\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until
c:\users\gaurav\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """

In [115]:
t2=df_test.isnull().sum()
t2

PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [116]:
df_train = pd.get_dummies(df_train, drop_first=True)
df_train.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
0,1,3,22.0,1,0,7.2500,1,0,1
1,2,1,38.0,1,0,71.2833,0,0,0
2,3,3,26.0,0,0,7.9250,0,0,1
3,4,1,35.0,1,0,53.1000,0,0,1
4,5,3,35.0,0,0,8.0500,1,0,1

In [117]:
df_test = pd.get_dummies(df_test, drop_first=True)
df_test.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
0,892,3,34.5,0,0,7.8292,1,1,0
1,893,3,47.0,1,0,7.0000,0,0,1
2,894,2,62.0,0,0,9.6875,1,1,0
3,895,3,27.0,0,0,8.6625,1,0,1
4,896,3,22.0,1,1,12.2875,0,0,1

In [118]:
t1=df_train.isnull().sum()
t1

PassengerId    0
Pclass         0
Age            0
SibSp          0
Parch          0
Fare           0
Sex_male       0
Embarked_Q     0
Embarked_S     0
dtype: int64

In [119]:
t2=df_test.isnull().sum()
t2

PassengerId    0
Pclass         0
Age            0
SibSp          0
Parch          0
Fare           0
Sex_male       0
Embarked_Q     0
Embarked_S     0
dtype: int64

In [128]:
%%time
pipe = pipeline.Pipeline([
    ("poly", preprocessing.PolynomialFeatures(degree=2, include_bias=False)),
    ("scaler", preprocessing.StandardScaler()),
    ("est", linear_model.SGDClassifier(loss="log",
                                       penalty = "elasticnet",
                                       learning_rate = "invscaling",
                                       eta0 = 0.01, 
                                       max_iter = 2000,
                                       tol = 1e-4
                                      ))
])


pipe.fit(df_train,y)


y_test_prob = pipe.predict_proba(df_test)
y_train_pred = pipe.predict(df_train)
y_test_pred = pipe.predict(df_test)

#plot_confusion_matrix(metrics.confusion_matrix(y, y_train_pred))

print("training r2:", metrics.r2_score(y, y_train_pred))

training r2: 0.14581535806729928
Wall time: 109 ms

In [156]:
%%time

param_grid = {
    "poly__degree": np.linspace(1,4,3,dtype="int32"),
    "est__l1_ratio": np.linspace(0, 1, 10),
    "est__alpha": np.linspace(0.04, 0.09, 10)
}

gsearch = model_selection.GridSearchCV(cv=5, 
                                       estimator=pipe, 
                                       n_jobs=4, 
                                       param_grid=param_grid)
gsearch.fit(df_train, y)

Wall time: 1min 29s

In [157]:
est=gsearch.best_estimator_
print(est)
print(gsearch.best_score_)

Pipeline(memory=None,
     steps=[('poly', PolynomialFeatures(degree=4, include_bias=False, interaction_only=False)), ('scaler', StandardScaler(copy=True, with_mean=True, with_std=True)), ('est', SGDClassifier(alpha=0.04, average=False, class_weight=None, epsilon=0.1,
       eta0=0.01, fit_intercept=True, l1_ratio=0.0,
      ...et', power_t=0.5, random_state=None,
       shuffle=True, tol=0.0001, verbose=0, warm_start=False))])
0.8204264870931538

In [158]:
y_test_predict=pipe.predict(df_test)

In [160]:
y_test_predict[:10]

array([0, 1, 0, 0, 1, 0, 1, 0, 1, 0], dtype=int64)

In [161]:
res=pd.DataFrame({"PassengerId": df_test.PassengerId ,"Survived ":y_test_pred})

In [162]:
res.to_csv(r"result.csv",index=False)

#### Upload the "result.csv" to kaggle <br/><br/> -------------------------------------------------------------------------------------------END-------------------------------------------------------------------------------------------------